Revit 2024 API
CompoundStructureError Enumeration
 When CompoundStructure::isValid() returns false, it uses these values to indicate precise nature of defect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum CompoundStructureError
Visual Basic
Public Enumeration CompoundStructureError
Visual C++
public enum class CompoundStructureError
Members
Member name | Description
BadShellOrder |  Layer Function Priorities ascend from the Core Boundary to the Finish Face.
CoreTooThin |  Core contain a membrane layer or thickness of core is zero.
MembraneTooThick |  Thickness of membrane layer is more than zero.
NonmembraneTooThin |  Thickness of non-membrane layer is too thin.
BadShellsStructure |  The number of shell layers is larger than the total number of layers.
ThinOuterLayer |  Thickness of face layer is too thin.
VerticalUnusedLayer |  A layer is not membrane layer and the Thickness of layer is zero.
VerticalWrongOrderLayer |  Layers assigned to the same Row are not on the same side of the Core Boundary.
VerticalWrongOrderCoreExterior |  Exterior core boundary have more than one face at any height.
VerticalWrongOrderCoreInterior |  Interior core boundary have more than one face at any height.
VerticalWrongOrderMembrane |  Membrane Layer have more than one face at any height.
DeckCantBoundAbove |  There is no layer above Structural deck or it is too thin.
DeckCantBoundBelow |  There is no layer below Structural deck or it is too thin.
VarThickLayerCantBeZero |  Variable thickness layer have zero thickness.
InvalidMaterialId |  Element id used as material id does not correspond to an actual MaterialElem.
ExtensibleRegionsNotContiguousAlongTop |  Extension Layers at the top of the wall must be adjacent.
ExtensibleRegionsNotContiguousAlongBottom |  Extension Layers at the bottom of the wall must be adjacent.
InvalidProfileId |  Element id used as profile id does not correspond to a valid deck profile.
Remarks
 'LayerTooThin' enum value was removed in 2016
See Also
Autodesk.Revit.DB Namespace